{"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "<UNK>": 3, "step": 4, "1:": 5, "the": 6, "leaf": 7, "shows": 8, "several": 9, "dark": 10, "brown": 11, "spots": 12, "on": 13, "surface": 14, "of": 15, ".": 16, "2:": 17, "patterns": 18, "indicate": 19, "that": 20, "are": 21, "scattered": 22, "across": 23, "and": 24, "appear": 25, "to": 26, "be": 27, "spreading": 28, "3:": 29, "this": 30, "aligns": 31, "with": 32, "symptoms": 33, "septoria": 34, "spot": 35, ",": 36, "which": 37, "is": 38, "a": 39, "fungal": 40, "infection": 41, "causes": 42, "leaves": 43, "conclusion:": 44, "suffering": 45, "from": 46, "distinct": 47, "heart-shaped": 48, "outline": 49, "smooth": 50, "texture": 51, "no": 52, "visible": 53, "damage": 54, "or": 55, "disease": 56, "healthy": 57, "plant": 58, "does": 59, "not": 60, "exhibit": 61, "any": 62, "signs": 63, "pest": 64, "in": 65, "image": 66, "grape": 67, "[observation]": 68, "appears": 69, "have": 70, "green": 71, "color": 72, "typical": 73, "structure": 74, "including": 75, "veins": 76, "edges": 77, "[symptom]": 78, "there": 79, "such": 80, "as": 81, "yellowing": 82, "lesions": 83, "characteristic": 84, "tomato": 85, "mosaic": 86, "virus": 87, "[disease/cause]": 88, "absence": 89, "typically": 90, "associated": 91, "suggests": 92, "show": 93, "discoloration": 94, "browning": 95, "common": 96, "mold": 97, "affected": 98, "by": 99, "diagnosis": 100, "observed": 101, "consistent": 102, "characteristics": 103, "circular": 104, "lesion": 105, "center": 106, "lighter": 107, "halo": 108, "around": 109, "it": 110, "symptom": 111, "target": 112, "fungus": 113, "affecting": 114, "plants": 115, "caused": 116, "known": 117, "for": 118, "causing": 119, "foliage": 120, "has": 121, "been": 122, "presence": 123, "lose": 124, "vitality": 125, "indicators": 126, "chlorosis": 127, "due": 128, "lack": 129, "chlorophyll": 130, "unevenly": 131, "distributed": 132, "suggesting": 133, "cause": 134, "might": 135, "localized": 136, "stress": 137, "nutrient": 138, "deficiency": 139, "deficiencies": 140, "orange": 141, "trees": 142, "can": 143, "factors": 144, "iron": 145, "tree": 146, "particularly": 147, "curling": 148, "yellow": 149, "curl": 150, "(tylcv)": 151, "become": 152, "distorted": 153, "rolled": 154, "under": 155, "tylcv": 156, "described": 157, "alternaria": 158, "solani": 159, "infected": 160, "loss": 161, "distortion": 162, "exhibits": 163, "pathology": 164, "infectious": 165, "agent": 166, "decay": 167, "areas": 168, "pathogen": 169, "deteriorate": 170, "obvious": 171, "irregularly": 172, "shaped": 173, "yellowish-brown": 174, "margin": 175, "bacterial": 176, "blight": 177, "pustular": 178, "structures": 179, "these": 180, "likely": 181, "possibility": 182, "dead": 183, "tissue": 184, "zones": 185, "distinctive": 186, "ring": 187, "formations": 188, "diseases": 189, "general": 190, "decline": 191, "health": 192, "potential": 193, "factor": 194, "candidatus": 195, "liberibacter": 196, "asiaticus": 197, "leading": 198, "huanglongbing": 199, "photograph": 200, "viral": 201, "infections": 202, "mosaic-like": 203, "appearance": 204, "where": 205, "host": 206, "produce": 207, "mimic": 208, "virus's": 209, "own": 210, "shape": 211, "pointed": 212, "tip": 213, "edge": 214, "grapevines": 215, "specimen": 216, "mite": 217, "infestation": 218, "two-spotted": 219, "spider": 220, "feeding": 221, "tissues": 222, "damaged": 223, "late": 224, "clear": 225, "demarcation": 226, "between": 227, "diseased": 228, "seen": 229, "phytophthora": 230, "infestans": 231, "lower": 232, "side": 233, "(hlb)": 234, "citrus": 235, "greening": 236, "bacteria": 237, "xylella": 238, "fastidiosa": 239, "affects": 240, "indicative": 241, "pustules": 242, "evidence": 243, "numerous": 244, "small": 245, "rust": 246, "many": 247, "species": 248, "cherry": 249, "abnormalities": 250, "without": 251, "free": 252, "disease-induced": 253, "lost": 254, "its": 255, "normal": 256, "developed": 257, "blotchy": 258, "asymmetrical": 259, "uniformity": 260, "symmetry": 261, "classic": 262, "hlb": 263, "(huanglongbing)": 264, "stippled": 265, "webbing": 266, "holes": 267, "uninfected": 268, "features": 269, "apparent": 270, "disease-free": 271, "clearly": 272, "evenly": 273, "indicating": 274, "good": 275, "observation": 276, "potato": 277, "flora": 278, "margins": 279, "water-soaked": 280, "rather": 281, "than": 282, "natural": 283, "variation": 284, "coloration": 285, "characterized": 286, "shown": 287, "borders": 288, "pale": 289, "central": 290, "often": 291, "centers": 292, "yellowish": 293, "commonly": 294, "found": 295, "tomatoes": 296, "vegetation": 297, "sample": 298, "wilting": 299, "widespread": 300, "both": 301, "surrounding": 302, "nitrogen": 303, "blueberry": 304, "but": 305, "some": 306, "form": 307, "environmental": 308, "peach": 309, "based": 310, "stippling": 311, "fine": 312, "undersides": 313, "botanical": 314, "classification": 315, "pests": 316, "injury": 317, "distinctively": 318, "large": 319, "blade": 320, "prominent": 321, "vein": 322, "venation": 323, "broadleaf": 324, "solanaceae": 325, "family": 326, "eggplant": 327, "corn": 328, "possible": 329, "patches": 330, "broad": 331, "base": 332, "morphology": 333, "growth": 334, "black": 335, "oval": 336, "spread": 337, "merge": 338, "into": 339, "larger": 340, "bacterium": 341, "irregular": 342, "sunken": 343, "border": 344, "oomycete": 345, "deviation": 346, "other": 347, "single": 348, "size": 349, "target-like": 350, "presents": 351, "unhealthy": 352, "receiving": 353, "adequate": 354, "nutrients": 355, "light": 356, "lead": 357, "deprivation": 358, "displays": 359, "along": 360, "well": 361, "development": 362, "mottling": 363, "merit": 364, "brownish": 365, "fungi": 366, "pathological": 367, "condition": 368, "paired": 369, "olive-green": 370, "undersurface": 371, "(yellowing)": 372, "necrosis": 373, "(death": 374, "tissue)": 375, "concentric": 376, "'bullseye'": 377, "running": 378, "down": 379, "may": 380, "web-like": 381, "covering": 382, "leaf's": 383, "compromised": 384, "smaller": 385, "branching": 386, "off": 387, "variety": 388, "developing": 389, "normally": 390, "disorder": 391, "showing": 392, "hue": 393, "through": 394, "abnormal": 395, "pathogen-free": 396, "attributes": 397, "significant": 398, "portion": 399, "area": 400, "having": 401, "yellowish-green": 402, "losing": 403, "becoming": 404, "more": 405, "palmate": 406, "radiate": 407, "pattern": 408, "apple": 409, "an": 410, "mottled": 411, "(tobacco": 412, "curve": 413, "virus)": 414, "being": 415, "could": 416, "develop": 417, "do": 418, "specific": 419, "alternating": 420, "randomly": 421, "turgidity": 422, "glossy": 423, "taxonomic": 424, "their": 425, "elongated": 426, "ornamental": 427, "araceae": 428, "includes": 429, "like": 430, "philodendron": 431, "monstera": 432, "powdery": 433, "white": 434, "substance": 435, "mildew": 436, "midrib": 437, "display": 438, "orange-yellow": 439, "embedded": 440, "dots": 441, "multiple": 442, "distress": 443, "reddish-brown": 444, "peripheral": 445, "causal": 446, "behind": 447, "state": 448, "optimal": 449, "(tomato": 450, "distribution": 451, "early": 452, "potatoes": 453, "identity": 454, "greenish": 455, "them": 456, "turn": 457, "experiencing": 458, "pathogens": 459, "contracted": 460, "insect": 461, "overall": 462, "chewed": 463, "animal": 464, "esca": 465, "measles": 466, "plasmopara": 467, "viticola": 468, "scorch": 469, "drying": 470, "drought": 471, "heat": 472, "cold": 473, "minor": 474, "turning": 475, "tips": 476, "physical": 477, "extensive": 478, "moldy": 479, "angular": 480, "slightly": 481, "undulating": 482, "mites": 483, "plant's": 484, "vigorous": 485, "deformities": 486, "expected": 487, "uneven": 488, "varied": 489, "morphologies": 490, "similar": 491, "ailment": 492, "uniformly": 493, "would": 494, "suggest": 495, "oval-shaped": 496, "slight": 497, "glossiness": 498, "depicts": 499, "responsible": 500, "ideal": 501, "functional": 502, "various": 503, "sterile": 504, "resembling": 505, "cigars": 506, "gray-tan": 507, "round": 508, "botrytis": 509, "cinerea": 510, "compound": 511, "turned": 512, "tan-colored": 513, "marginal": 514, "boundaries": 515, "strawberry": 516, "evidenced": 517, "possibly": 518, "currently": 519, "physiological": 520, "wither": 521, "material": 522, "darker": 523, "soybean": 524, "visual": 525, "single-lobed": 526, "description": 527, "hole": 528, "discolored": 529, "growing": 530, "vigorously": 531, "insects": 532, "aphids": 533, "matches": 534, "creating": 535, "well-functioning": 536, "perfect": 537, "operation": 538, "cucurbits": 539, "secondary": 540, "illustrates": 541, "microbial": 542, "activity": 543, "picture": 544, "underside": 545, "arranged": 546, "stripe-like": 547, "produces": 548, "infested": 549, "capable": 550, "producing": 551, "bull's-eye": 552, "appearances": 553, "covered": 554, "brownish-yellowish": 555, "blemishes": 556, "squash": 557, "rapidly": 558, "northern": 559, "helminthosporium": 560, "maydis": 561, "featuring": 562, "phyllosticta": 563, "specifically": 564, "identifiable": 565, "'target-like'": 566, "rings": 567, "demonstrate": 568, "robust": 569, "bullseye": 570, "present": 571, "standards": 572, "impacting": 573, "aging": 574, "processes": 575, "halos": 576, "velvety": 577, "yellowish-orange": 578, "manifestation": 579, "uncompromised": 580, "status": 581, "agents": 582, "upper": 583, "downy": 584, "corresponding": 585, "genus": 586, "diospyros": 587, "persimmon": 588, "appearing": 589, "others": 590, "vigor": 591, "intact": 592, "curled": 593, "those": 594, "stress-related": 595, "inward": 596, "fully": 597, "at": 598, "peak": 599, "change": 600, "undisturbed": 601, "disruption": 602, "parallel": 603, "die": 604, "perspective": 605, "well-formed": 606, "certain": 607, "affect": 608, "content": 609, "pepper": 610, "bell": 611, "functioning": 612, "usually": 613, "raspberry": 614, "disappear": 615, "after": 616, "elimination": 617, "effects": 618, "thriving": 619, "middle": 620, "if": 621, "were": 622, "absent": 623, "(tomv)": 624, "vegetation's": 625, "another": 626, "displaying": 627, "miners": 628, "chalky": 629, "powder": 630, "cercospora": 631, "house": 632, "roof": 633, "background": 634, "contain": 635, "solanum": 636, "tuberosum": 637, "follow": 638, "striped": 639, "vascular": 640, "following": 641, "evident": 642, "systemic": 643, "entire": 644, "rounded": 645, "serrated": 646, "different": 647, "soybeans": 648, "scientific": 649, "nomenclature": 650, "issue": 651, "problem": 652, "wavy": 653, "formed": 654, "outer": 655, "interiors": 656, "point": 657, "information": 658, "testing": 659, "definitively": 660, "diagnose": 661, "belongs": 662, "organism": 663, "wet-appearing": 664, "type": 665, "they": 666, "concentrated": 667, "match": 668, "eventually": 669, "circle": 670, "necrotic": 671, "recovered": 672, "wellness": 673, "mottle": 674, "pathogen-infected": 675, "poor": 676, "uniform": 677, "member": 678, "saturated": 679, "chlorotic": 680, "park": 681, "setting": 682, "fountain": 683, "people": 684, "walking": 685, "arrangement": 686, "narrower": 687, "wilt": 688, "body": 689, "water": 690, "shoreline": 691, "plant-related": 692, "since": 693, "elements": 694, "concluded": 695, "primary": 696, "subject": 697, "related": 698, "depict": 699, "mechanical": 700, "healthy-looking": 701, "moisture-filled": 702, "pathogenic": 703, "infect": 704, "well-maintained": 705, "darkening": 706, "correct": 707, "answer": 708, "provided": 709, "boundary": 710, "within": 711, "given": 712, "aligned": 713, "fern": 714, "pinnate": 715, "stressors": 716, "well-known": 717, "attack": 718, "belong": 719, "contributing": 720, "deteriorated": 721, "should": 722, "one": 723, "marked": 724, "observable": 725, "exhibiting": 726, "rot": 727, "monilinia": 728, "fructicola": 729, "near": 730, "water's": 731, "confined": 732, "stunting": 733, "prominently": 734, "while": 735, "patterning": 736, "successful": 737, "treatment": 738, "vivid": 739, "punctate": 740, "looking": 741, "rough": 742, "shapes": 743, "varying": 744, "sizes": 745, "colors": 746, "greenish-brown": 747, "raised": 748, "perimeter": 749, "markings": 750, "well-defined": 751, "disease-caused": 752, "abnormality": 753, "misshapen": 754, "frayed": 755, "eaten": 756, "developmental": 757, "external": 758, "force": 759, "undamaged": 760, "intensities": 761, "fruits": 762, "viruses": 763, "brownish-black": 764, "herbivory": 765, "manifestations": 766, "view": 767, "inside": 768, "vehicle": 769, "out": 770, "onto": 771, "road": 772, "straight": 773, "stretches": 774, "distance": 775, "either": 776, "haunglongbing": 777, "symmetrical": 778, "distributions": 779, "marina": 780, "boats": 781, "docked": 782, "pier": 783, "align": 784, "question": 785, "about": 786, "street": 787, "scene": 788, "pooling": 789, "low-lying": 790, "drainage": 791, "flooding": 792, "accumulation": 793, "heavy": 794, "rain": 795, "system": 796, "light-colored": 797, "caterpillar": 798, "head": 799, "tail": 800, "gray": 801, "also": 802, "maximum": 803, "level": 804, "demonstrating": 805, "function": 806, "clustered": 807, "noticeable": 808, "distortions": 809, "few": 810, "rust-colored": 811, "eruptions": 812, "asymmetric": 813, "warrant": 814, "proper": 815, "blotching": 816, "stunt": 817, "compared": 818, "clavibacter": 819, "michiganensis": 820, "subsp": 821, "citri": 822, "variations": 823, "contrasting": 824, "vehicles": 825, "puddle": 826, "parts": 827, "objects": 828, "simple": 829, "flourishing": 830, "deterioration": 831, "main": 832, "asteraceae": 833, "hornworms": 834, "olive-brown": 835, "fuzziness": 836, "cylindrical": 837, "textured": 838, "changes": 839, "conditions": 840, "traits": 841, "stipules": 842, "irregularities": 843, "disease-related": 844, "line": 845, "accompanied": 846, "speckling": 847, "zone": 848, "coating": 849, "somewhat": 850, "response": 851, "magnesium": 852, "identified": 853, "upward": 854, "reduction": 855, "flat": 856, "grayish-white": 857, "foreground": 858, "soft": 859, "surfaces": 860, "markers": 861, "cease": 862, "exist": 863, "post-recovery": 864, "contains": 865, "landscape": 866, "stretching": 867, "paved": 868, "focusing": 869, "extending": 870, "statue": 871, "potassium": 872, "vibrant": 873, "interveinal": 874, "achieving": 875, "uptake": 876, "cigar-like": 877, "grayish-tan": 878, "brown-olive": 879, "fuzzy": 880, "qualities": 881, "herbivores": 882, "prospering": 883, "classified": 884, "surrounded": 885, "shades": 886, "red": 887, "cake": 888, "decorations": 889, "include": 890, "pink": 891, "candle": 892, "butterfly": 893, "berries": 894, "well-developed": 895, "shiny": 896, "candles": 897, "remain": 898, "rest": 899, "turns": 900, "remaining": 901, "nodorum": 902, "below": 903, "mixture": 904, "elliptical": 905, "greenish-yellow": 906, "rutaceae": 907, "brown-black": 908, "disease-causing": 909, "organisms": 910, "lobed": 911, "lobes": 912, "used": 913, "identify": 914, "completely": 915, "symptom-free": 916, "blotches": 917, "photosynthesis": 918, "performance": 919, "isariopsis": 920, "spaced": 921, "problems": 922, "created": 923, "deformed": 924, "lycopersici": 925, "create": 926, "web": 927, "formation": 928, "typically\u8868\u73b0\u4e3a\u5c0f\u7684\u3001\u6697\u8272\u7684\u3001\u6c34\u6d78\u72b6\u7684\u6591\u70b9\u3002": 929, "flowering": 930, "infection:": 931, "hills": 932, "together": 933, "sporulating": 934, "spores": 935, "harbor": 936, "buildings": 937, "aberrations": 938, "results": 939, "determine": 940, "blisters": 941, "reduce": 942, "deformation": 943, "malformation": 944, "brownish-red": 945, "lycopersicum": 946, "bright": 947, "orange-brown": 948, "genetic": 949, "grapevine": 950, "habits": 951, "herbivore": 952, "spot;": 953, "definitive": 954, "lateral": 955, "unlikely": 956, "hornworm": 957, "properties": 958, "perfectly": 959, "indicates": 960, "result": 961, "all": 962, "symptomatic": 963, "tan": 964, "entirely": 965, "scab": 966, "dense": 967, "layer": 968, "itself": 969, "broader": 970, "forming": 971, "tiger-like": 972, "stripes": 973, "tiger-striped": 974, "symmetrically": 975, "restrictions": 976, "properly": 977, "potentially": 978, "version": 979, "population": 980, "infestations": 981, "complete": 982, "bleaching": 983, "disorders": 984, "stress-induced": 985, "pseudomonas": 986, "syringae": 987, "clusters": 988, "stressed": 989, "yachts": 990, "work": 991, "oblong": 992, "pustule": 993, "foliage;": 994, "disease-specific": 995, "lemon": 996, "lime": 997, "effect": 998, "age": 999, "phenomenon": 1000, "fruiting": 1001, "bodies": 1002, "death": 1003, "further": 1004, "investigation": 1005, "needed": 1006, "exact": 1007, "caterpillars": 1008, "larvae": 1009, "feed": 1010, "types": 1011, "fact": 1012, "whereas": 1013, "pronounced": 1014, "stages": 1015, "part": 1016, "indeed": 1017, "imperfections": 1018, "non-fungal": 1019, "non-specific": 1020, "streaks": 1021, "optimally": 1022, "waterfall": 1023, "cascading": 1024, "rocky": 1025, "cliff": 1026, "life": 1027}